; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v5 ?v10)
             (pred_8 ?v9 ?v13)
             (pred_5 ?v5 ?v13)
             (pred_6 ?v4 ?v5 )
	     (pred_11 ?v5)
             (pred_1 ?v7)
             (pred_9 ?v9)
             (pred_4 ?v13)
             (pred_12 ?v5)
             (pred_10 ?v9)
             (pred_7 ?v5)
             (pred_2 ))



(:action op_2
:parameters (?v11 ?v12 ?v3 ?v6)
:precondition (and (pred_1 ?v11) (pred_1 ?v12) (pred_9 ?v3) (pred_4 ?v6)
          (pred_3 ?v11 ?v12) (pred_8 ?v3 ?v6)
                   (pred_5 ?v12 ?v6) (pred_11 ?v11) 
                   (pred_12 ?v12) (pred_10 ?v3))
:effect (and  (pred_7 ?v12) (not (pred_12 ?v12))))


(:action op_1
:parameters (?v11 ?v2)
:precondition (and (pred_1 ?v11) (pred_1 ?v2)
               (pred_11 ?v11) (pred_3 ?v11 ?v2) (pred_7 ?v2))
:effect (and (pred_11 ?v2) (not (pred_11 ?v11))))

(:action op_3
:parameters (?v11 ?v3)
:precondition (and (pred_1 ?v11) (pred_9 ?v3) 
                  (pred_11 ?v11) (pred_6 ?v3 ?v11) (pred_2 ))
:effect (and (pred_10 ?v3)
   (not (pred_6 ?v3 ?v11)) (not (pred_2 ))))


(:action op_5
:parameters (?v11 ?v1 ?v8)
:precondition (and (pred_1 ?v11) (pred_9 ?v1) (pred_9 ?v8)
                  (pred_11 ?v11) (pred_10 ?v8) (pred_6 ?v1 ?v11))
:effect (and (pred_10 ?v1) (pred_6 ?v8 ?v11)
        (not (pred_10 ?v8)) (not (pred_6 ?v1 ?v11))))

(:action op_4
:parameters (?v11 ?v3)
:precondition (and (pred_1 ?v11) (pred_9 ?v3) 
                  (pred_11 ?v11) (pred_10 ?v3))
:effect (and (pred_2 ) (pred_6 ?v3 ?v11) (not (pred_10 ?v3)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_14 obj_21 obj_17 obj_01 obj_08 obj_05 obj_10 obj_19 obj_16 obj_04 obj_03 obj_18 obj_13 obj_06 obj_12 obj_07
    obj_11 obj_20
    obj_02 obj_09 obj_15
    )

    (:init
       (pred_2)

       (pred_1 obj_14)
       (pred_1 obj_21)
       (pred_1 obj_17)
       (pred_1 obj_01)
       (pred_1 obj_08)
       (pred_1 obj_05)
       (pred_1 obj_10)
       (pred_1 obj_19)
       (pred_1 obj_16)
       (pred_1 obj_04)
       (pred_1 obj_03)
       (pred_1 obj_18)
       (pred_1 obj_13)
       (pred_1 obj_06)
       (pred_1 obj_12)
       (pred_1 obj_07)
       (pred_4 obj_11)
       (pred_4 obj_20)
       (pred_9 obj_02)
       (pred_9 obj_09)
       (pred_9 obj_15)

       (pred_3 obj_14 obj_08)
       (pred_3 obj_14 obj_21)
       (pred_3 obj_21 obj_05)
       (pred_3 obj_21 obj_17)
       (pred_3 obj_21 obj_14)
       (pred_3 obj_17 obj_10)
       (pred_3 obj_17 obj_01)
       (pred_3 obj_17 obj_21)
       (pred_3 obj_01 obj_19)
       (pred_3 obj_01 obj_17)
       (pred_3 obj_08 obj_16)
       (pred_3 obj_08 obj_05)
       (pred_3 obj_08 obj_14)
       (pred_3 obj_05 obj_04)
       (pred_3 obj_05 obj_10)
       (pred_3 obj_05 obj_21)
       (pred_3 obj_05 obj_08)
       (pred_3 obj_10 obj_03)
       (pred_3 obj_10 obj_19)
       (pred_3 obj_10 obj_17)
       (pred_3 obj_10 obj_05)
       (pred_3 obj_19 obj_18)
       (pred_3 obj_19 obj_01)
       (pred_3 obj_19 obj_10)
       (pred_3 obj_16 obj_13)
       (pred_3 obj_16 obj_04)
       (pred_3 obj_16 obj_08)
       (pred_3 obj_04 obj_06)
       (pred_3 obj_04 obj_03)
       (pred_3 obj_04 obj_05)
       (pred_3 obj_04 obj_16)
       (pred_3 obj_03 obj_12)
       (pred_3 obj_03 obj_18)
       (pred_3 obj_03 obj_10)
       (pred_3 obj_03 obj_04)
       (pred_3 obj_18 obj_07)
       (pred_3 obj_18 obj_19)
       (pred_3 obj_18 obj_03)
       (pred_3 obj_13 obj_06)
       (pred_3 obj_13 obj_16)
       (pred_3 obj_06 obj_12)
       (pred_3 obj_06 obj_04)
       (pred_3 obj_06 obj_13)
       (pred_3 obj_12 obj_07)
       (pred_3 obj_12 obj_03)
       (pred_3 obj_12 obj_06)
       (pred_3 obj_07 obj_18)
       (pred_3 obj_07 obj_12)
       (pred_12 obj_05)
       (pred_12 obj_12)
       (pred_12 obj_01)
       (pred_5  obj_05 obj_11)
       (pred_5  obj_12 obj_20)
       (pred_5  obj_01 obj_11)
       (pred_7 obj_14)
       (pred_7 obj_21)
       (pred_7 obj_17)
       (pred_7 obj_08)
       (pred_7 obj_10)
       (pred_7 obj_19)
       (pred_7 obj_16)
       (pred_7 obj_04)
       (pred_7 obj_03)
       (pred_7 obj_18)
       (pred_7 obj_13)
       (pred_7 obj_06)
       (pred_7 obj_07)

       (pred_8  obj_02 obj_11)
       (pred_8  obj_09 obj_20)
       (pred_8  obj_15 obj_20)
       (pred_6 obj_02 obj_21)
       (pred_6 obj_09 obj_10)
       (pred_6 obj_15 obj_01)
       (pred_11 obj_14)
    )

    (:goal (and
       (pred_6 obj_02 obj_04)
       (pred_6 obj_09 obj_17)
    ))
(:constraints
  (always (not (pred_11 obj_03)))
)
)

; plan
1. (op_1 obj_14 obj_21)
   deleted: (pred_11 obj_14)
   added: (pred_11 obj_21)
   goals met: 0 of 2
2. (op_1 obj_21 obj_17)
   deleted: (pred_11 obj_21)
   added: (pred_11 obj_17)
   goals met: 0 of 2
3. (op_1 obj_17 obj_10)
   deleted: (pred_11 obj_17)
   added: (pred_11 obj_10)
   goals met: 0 of 2
4. (op_3 obj_10 obj_09)
   deleted: (pred_6 obj_09 obj_10) (pred_2)
   added: (pred_10 obj_09)
   goals met: 0 of 2
5. (op_1 obj_10 obj_17)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_17)
   goals met: 0 of 2
6. (op_4 obj_17 obj_09)
   deleted: (pred_10 obj_09)
   added: (pred_2) (pred_6 obj_09 obj_17)
   goals met: 1 of 2
7. (op_1 obj_17 obj_21)
   deleted: (pred_11 obj_17)
   added: (pred_11 obj_21)
   goals met: 1 of 2
8. (op_3 obj_21 obj_02)
   deleted: (pred_6 obj_02 obj_21) (pred_2)
   added: (pred_10 obj_02)
   goals met: 1 of 2
9. (op_2 obj_21 obj_05 obj_02 obj_11)
   deleted: (pred_12 obj_05)
   added: (pred_7 obj_05)
   goals met: 1 of 2
10. (op_1 obj_21 obj_05)
   deleted: (pred_11 obj_21)
   added: (pred_11 obj_05)
   goals met: 1 of 2
11. (op_1 obj_05 obj_04)
   deleted: (pred_11 obj_05)
   added: (pred_11 obj_04)
   goals met: 1 of 2
12. (op_4 obj_04 obj_02)
   deleted: (pred_10 obj_02)
   added: (pred_2) (pred_6 obj_02 obj_04)
   goals met: 2 of 2
